byte numbers[10][8]= {
{1, 1, 1, 1, 1, 1, 0, 0}, // 0
{0, 1, 1, 0, 0, 0, 0, 0}, // 1
{1, 1, 0, 1, 1, 0, 1, 0}, // 2
{1, 1, 1, 1, 0, 0, 1, 0}, // 3
{0, 1, 1, 0, 0, 1, 1, 0}, // 4
{1, 0, 1, 1, 0, 1, 1, 0}, // 5
{1, 0, 1, 1, 1, 1, 1, 0}, // 6
{1, 1, 1, 0, 0, 1, 0, 0}, // 7
{1, 1, 1, 1, 1, 1, 1, 0}, // 8
{1, 1, 1, 1, 0, 1, 1, 0} // 9
};

int pin = 2; 
int num = 0;
   // 7-세그먼트의 LED 요소 a를 아두이노의 디지털 2번 핀과 연결
void setup() {
    for (int i = 2; i <= 9; i++) { 
        pinMode(i, OUTPUT);
    }
   digitalWrite(9, HIGH);     // 시작과 동시에 LED 요소 a에 불이 켜짐
}

void loop() {
for(int i = 0; i < 8; i++) {
        digitalWrite(pin+i, numbers[num][i]);
    }
    num++;
    if (num > 9) num = 0;
    delay(1000);
}


